0=정상처리 되었습니다.
2001=마스터가 온라인이 아닙니다.
2002=이메일이 없습니다.
2003=마스터-카피어 관계가 없습니다.
2004=User ID 가 없습니다.
2005=MT4 Account 가 없습니다.
2006=USERID 가 이미 존재합니다.
2007=해당 주문이 없습니다.
2008=주문타입 오류 입니다.
2009=비밀번호 오류 입니다.
2010=로그인 불가 계정입니다.
2011=해당 마스터는 서버가 배정되지 않았습니다.
2012=온라인 상태가 아닙니다.
2013=종료되었습니다.
2014=타임아웃 입니다.
2015=정의되지 않은 오류코드 입니다.
2016=종목설정을 먼저 하셔야 합니다.
2017=이 MT4 Account 는 이미 사용중 입니다.
3001=MT4 주문 중 오류가 발생했습니다.
3002=MT4 조회 중 오류가 발생했습니다.
3003=설정-주문수량 오류 입니다.
3004=설정-Symbol 오류 입니다.
3005=설정-슬리피지 오류 입니다.
3006=설정-주문가격 오류 입니다.
3007=주문 실행 준비가 안됐습니다.
3008=Alpha 서버로 연결 오류 입니다.
3009=라이브러리 로드 오류 입니다.
3010=진입주문 Publishing 에 실패했습니다.
3011=청산주문 Publishing 에 실패했습니다.
3012=기능이 구현되지 않았습니다.
3013=MT4 주문 조회 중 오류 입니다.
3014=MT4 에서 INDEX 초과 오류 입니다.
3015=서버에 의해서 로그아웃 되었습니다.
3016=서버에서 연결을 종료했습니다.
3017=잘못된 심볼입니다.
3018=잘못된 TICKET NO. 입니다.
3019=잘못된 TICK 정보 입니다.
1001=통신모듈 초기화 오류입니다.
1002=통신모듈 생성 오류 입니다.
1003=통신연결에 실패했습니다.
1004=연결되어 있지 않습니다.
1005=데이터 전송 오류 입니다.
1006=데이터 수신 오류 입니다.
1101=패킷상 코드가 없습니다.
1102=패킷의 마스터/카피어 구분이 잘못됐습니다.
1103=USERID 가 없습니다.
1104=패킷 코드가 유효하지 않습니다.
1105=패킷에 마스터ID 가 없습니다.
1106=패킷에 MT4 계좌번호가 없습니다.
1107=패킷에 마스터의 MT4 계좌번호가 없습니다.
1108=패킷에 데이터가 누락되었습니다.
1109=패킷에 NICK NAME 이 없습니다.
1201=데이터베이스 처리 중 예외가 발생했습니다.
1202=설정파일 조회 오류 입니다.
1203=메세지 파일 조회 오류 입니다.
9999=정의되지 않은 오류 입니다.